{
  "architectures": [
      "MistralForCausalLM"
  ],
  "bos_token_id": 2,
  "eos_token_id": 3,
  "hidden_act": "silu",
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 1024,
  "model_type": "mistral",
  "num_attention_heads": 8,
  "num_hidden_layers": 16,
  "num_key_value_heads": 4,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.35.2",
  "use_cache": true,
  "vocab_size": 32000
}